Диплом21_августа_новый/src/Documents/ВКМ_НачислениеПремии/ВКМ_НачислениеПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом21_августа_новый/src/Documents/ВКМ_НачислениеПремии/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СотрудникиСуммаПремииПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Сотрудники.ТекущиеДанные; 
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите сотрудника.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.СуммаПремии) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните сумму премии.");
		Возврат;
	КонецЕсли; 
	
	НДФЛ = ПолучитьСтавкуНДФЛНаСервере();
	
	СтрокаТЧ.НДФЛ = Окр(СтрокаТЧ.СуммаПремии * НДФЛ / 100, 2);
	СтрокаТЧ.СуммаКВыплате = СтрокаТЧ.СуммаПремии - СтрокаТЧ.НДФЛ;
	
	ПолучитьСтавкуНДФЛНаСервере(); 
	
КонецПроцедуры

 &НаСервере
 Функция ПолучитьСтавкуНДФЛНаСервере() 
	 
	Ставка = Константы.ВКМ_НДФЛ.Получить();
	
	Возврат Ставка; 
	
КонецФункции
